In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.preprocessing import LabelEncoder
from sklearn import tree
data = pd.read_csv("Fraud_check.csv")
data.head()

  Undergrad MaritalStatus  TaxableIncome  CityPopulation  WorkExperience Urban
0        NO        Single          68833           50047              10   YES
1       YES      Divorced          33700          134075              18   YES
2        NO       Married          36925          160205              30   YES
3       YES        Single          50190          193264              15   YES
4        NO       Married          81002           27533              28    NO

In [2]:
data.TaxableIncome.describe()

count      600.000000
mean     55208.375000
std      26204.827597
min      10003.000000
25%      32871.500000
50%      55074.500000
75%      78611.750000
max      99619.000000
Name: TaxableIncome, dtype: float64

In [3]:
data["TI1"]="risky"
data.loc[data.TaxableIncome<=30000,"TI1"]="good"
data=data.drop(["TaxableIncome"],axis=1)
data

    Undergrad MaritalStatus  CityPopulation  WorkExperience Urban    TI1
0          NO        Single           50047              10   YES  risky
1         YES      Divorced          134075              18   YES  risky
2          NO       Married          160205              30   YES  risky
3         YES        Single          193264              15   YES  risky
4          NO       Married           27533              28    NO  risky
..        ...           ...             ...             ...   ...    ...
595       YES      Divorced           39492               7   YES  risky
596       YES      Divorced           55369               2   YES  risky
597        NO      Divorced          154058               0   YES  risky
598       YES       Married          180083              17    NO  risky
599        NO      Divorced          158137              16    NO  risky

[600 rows x 6 columns]

In [4]:
lb=LabelEncoder()
data.MaritalStatus=lb.fit_transform(data[["MaritalStatus"]])
data.Undergrad=lb.fit_transform(data[["Undergrad"]])
data.Urban=lb.fit_transform(data[["Urban"]])
data

/opt/anaconda3/lib/python3.7/site-packages/sklearn/preprocessing/label.py:235: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

     Undergrad  MaritalStatus  CityPopulation  WorkExperience  Urban    TI1
0            0              2           50047              10      1  risky
1            1              0          134075              18      1  risky
2            0              1          160205              30      1  risky
3            1              2          193264              15      1  risky
4            0              1           27533              28      0  risky
..         ...            ...             ...             ...    ...    ...
595          1              0           39492               7      1  risky
596          1              0           55369               2      1  risky
597          0              0          154058               0      1  risky
598          1              1          180083              17      0  risky
599          0              0          158137              16      0  risky

[600 rows x 6 columns]

In [5]:
data.TI1.value_counts()

risky    476
good     124
Name: TI1, dtype: int64

In [6]:
colnames = list(data.columns)
colnames

['Undergrad',
 'MaritalStatus',
 'CityPopulation',
 'WorkExperience',
 'Urban',
 'TI1']

In [7]:
predictors = colnames[:5]
target = colnames[5]
from sklearn.model_selection import train_test_split
train,test = train_test_split(data,test_size = 0.2)

In [8]:


from sklearn.tree import  DecisionTreeClassifier

In [15]:
model = DecisionTreeClassifier(criterion = 'entropy',max_depth=3)
model.fit(train[predictors],train[target])

train[target]

413    risky
309    risky
338     good
491     good
286    risky
       ...
474    risky
288     good
232     good
372    risky
551    risky
Name: TI1, Length: 480, dtype: object

In [16]:
preds = model.predict(test[predictors])
preds

array(['risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky', 'risky', 'risky', 'risky', 'risky', 'risky', 'risky',
       'risky'], dtype=object)

In [17]:
pd.Series(preds).value_counts()

risky    120
dtype: int64

In [18]:

pd.crosstab(test[target],preds)

col_0  risky
TI1
good      26
risky     94

In [19]:
np.mean(train.TI1 == model.predict(train[predictors]))

0.8

In [20]:
np.mean(preds==test.TI1)

0.7833333333333333

In [21]:
from sklearn.metrics import accuracy_score
score=accuracy_score(preds,test[target])
score

0.7833333333333333